app/controllers/receitas_controller.rb

SELECT * FROM "receitas"
---
  def lista
    @receitas = Receita.all

SELECT * FROM "receitas" WHERE ("receitas"."id" = 1)
---
  def show
    @receita = Receita.find(params[:id])

INSERT INTO "receitas" ("created_at", "ingredientes", "modo", "titulo", "autor", "updated_at", "observacoes") VALUES('2011-07-03 18:23:32', '1 xícara (chá) de leite (240ml);
---
  def create
    @receita = Receita.new(params[:receita])

    respond_to do |format|
      if @receita.save